In [1877]:
import pandas as pd

In [1878]:
import numpy as np

In [1879]:
students = pd.read_csv("student_records_dirty.csv")

In [1880]:
students.head()

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2/28/2024,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,30-Jan-24,12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2/10/2024,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2/8/2024,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,8-Feb-24,-20,3.2,NaN

In [1881]:
students.shape
#

(355, 9)

In [1882]:
students.sample(5)

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
70,17869,Priya,Brown,63,Bio,5-May-24,12,NaN,14388.71
161,15530,Noah,Martinez,55,CS,5/18/2024,64,3.2,17283.20
171,11853,Mia,Kim,74,psych,12-Jan-24,52,NaN,13409.56
2,15390,Priya,Garcia,52,bio,2/10/2024,95,1.9,19051.36
195,14218,Ravi,Patel,35,Biology,1/17/2024,NaN,2.7,20000.00

In [1883]:
#
students["course_grade"].value_counts(dropna=False)
#gives you a count of how many times each unique value appears in the course_grade column.

course_grade
100         36
12          34
 ninety     32
NaN         29
-20         27
95          27
0           27
52          25
85          25
64          25
88          24
3           22
76          19
"N/A"        3
Name: count, dtype: int64

In [1884]:
students['major'].value_counts(dropna=False)
#include null values in value counts, df pandas

major
Bio                 38
Comp Sci            38
Biology             38
PSYCH               33
CS                  31
psych               30
Psychology          30
Computer Science    29
BIO                 27
Psych               24
computer science    21
bio                 16
Name: count, dtype: int64

In [1885]:
students["first_name"].value_counts()

first_name
Liam       22
Jordan     21
Maria      20
Mia        20
Chloe      19
Luis       18
Sam        18
Noah       18
Olivia     17
Ravi       17
Jamie      17
Evan       16
Taylor     15
Zoe        15
Priya      14
Ben        14
Emma       12
Aisha      12
Alex       12
Ethan      10
EMMA        2
 Olivia     2
ZOE         2
Emma        2
luis        2
Sam         2
 Mia        2
 Priya      1
AISHA       1
Jamie       1
Ravi        1
 Chloe      1
Taylor      1
Ben         1
 Jordan     1
 Emma       1
Ethan       1
RAVI        1
 Taylor     1
jamie       1
Luis        1
Name: count, dtype: int64

In [1886]:
students.isna().sum()

student_id          0
first_name          0
last_name           0
age                 0
major               0
enrollment_date     0
course_grade       29
gpa                94
tuition_paid       21
dtype: int64

In [1887]:
students["course_grade"] = students["course_grade"].replace("\"N/A\"", np.nan)
# backsplash to include a character(interprets the quote character not indicating end of string)replacing value N/A with nan values

In [1888]:
students['course_grade'].value_counts(dropna=False)

course_grade
100         36
12          34
NaN         32
 ninety     32
95          27
-20         27
0           27
52          25
64          25
85          25
88          24
3           22
76          19
Name: count, dtype: int64

In [1889]:
students.duplicated()
#students.duplicated().sum()

0      False
1      False
2      False
3      False
4      False
       ...
350     True
351     True
352     True
353     True
354     True
Length: 355, dtype: bool

In [1890]:
students.drop_duplicates()
# we didnt assign it so next time when you call the data frame it is going to return the duplicates
students = students.drop_duplicates()

In [1891]:
students["student_id"].count()

C:\Users\sesha\AppData\Roaming\Python\Python313\site-packages\IPython\core\displayhook.py:292: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

np.int64(350)

In [1892]:
students["first_name"].str.strip().value_counts()
students["first_name"].str.strip().str.upper().value_counts()
#space in names, strip only removes from front or back

first_name
LIAM      22
JORDAN    21
MIA       21
SAM       20
MARIA     20
CHLOE     20
LUIS      20
OLIVIA    19
RAVI      19
JAMIE     18
NOAH      18
TAYLOR    17
EMMA      17
ZOE       17
EVAN      16
PRIYA     15
BEN       15
AISHA     13
ALEX      12
ETHAN     10
Name: count, dtype: int64

In [1893]:
students["first_name"] = students["first_name"].str.strip().str.upper()

In [1894]:
students["last_name"] = students["last_name"].str.strip().str.upper()

In [1895]:
students["major"].value_counts()

major
Bio                 38
Comp Sci            37
Biology             36
PSYCH               33
CS                  31
Computer Science    29
Psychology          29
psych               29
BIO                 27
Psych               24
computer science    21
bio                 16
Name: count, dtype: int64

In [1896]:
#students["major"].str.strip().str.capitalize()

In [1897]:
#students["major"] = students["major"].str.strip().str.capitalize()

In [1898]:
students["major"] = students["major"].str.strip().str.capitalize()

students["major"] = students["major"].replace({
"Comp sci": "Computer Science",
"Cs": "Computer Science",
"Computer science":"Computer Science",
"Bio": "Biology",
"Psych":"Psychology"

})

In [1899]:
students["major"].value_counts()

major
Computer Science    118
Biology             117
Psychology          115
Name: count, dtype: int64

In [1900]:
students.loc["ninety","course_grade"] = 90

In [1901]:
#students["age"].

In [1902]:
students["age"].value_counts(dropna = False)

age
74.0    12
32.0    11
33.0     9
85.0     9
49.0     8
        ..
87.0     2
47.0     2
57.0     1
27.0     1
NaN      1
Name: count, Length: 76, dtype: int64

In [1903]:
students["age"] = pd.to_numeric(students["age"], errors = "coerce")

In [1904]:
students["age"].describe()

count    350.000000
mean      53.768571
std       26.939509
min      -12.000000
25%       33.000000
50%       52.000000
75%       72.000000
max      230.000000
Name: age, dtype: float64

In [1905]:
students.loc[students["age"] < 10, ["age"]] = np.nan
students.loc[students["age"] >120, ["age"]] = np.nan

In [1906]:
students.loc[students["age"] < 10, ["age"]] = students["age"].mean()
students.loc[students["age"] >120, ["age"]] = students["age"].mean()

In [1907]:
students["age"].mean()

np.float64(52.61739130434783)

In [1908]:
# create a column combining first and last names
students["full_name"] = students["first_name"] + ' ' + students["last_name"]
students["full_name"]

0             TAYLOR CHEN
1         OLIVIA MARTINEZ
2            PRIYA GARCIA
3          PRIYA ANDERSON
4             NOAH WILSON
               ...
346             SAM DAVIS
347         EVAN MARTINEZ
348           AISHA BROWN
349          BEN MARTINEZ
ninety                NaN
Name: full_name, Length: 351, dtype: object

In [1909]:
students["age_group"] = pd.cut(
    students["age"],
    bins=[0, 25, 40, 65],
    labels=["Young Adults", "Working adults", "Retired"]
)

In [1910]:
students[["age","age_group"]].value_counts(dropna=False)

age   age_group
74.0  NaN               12
32.0  Working adults    11
33.0  Working adults     9
85.0  NaN                9
79.0  NaN                8
                        ..
64.0  Retired            2
86.0  NaN                2
87.0  NaN                2
57.0  Retired            1
27.0  Working adults     1
Name: count, Length: 74, dtype: int64

In [1911]:
students["cost_per_semester"] = students['tuition_paid'] / 3

In [1912]:
students["enrollment_date"]

0         2/28/2024
1         30-Jan-24
2         2/10/2024
3          2/8/2024
4          8-Feb-24
            ...
346       3/19/2024
347       28-Mar-24
348        1-Jan-24
349       30-Apr-24
ninety          NaN
Name: enrollment_date, Length: 351, dtype: object

In [1913]:
students["enrollment_date"] = pd.to_datetime(students["enrollment_date"])

ValueError: time data "30-Jan-24" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [ ]:
#students["enrollment_date"].describe(datetime_is_numeric)